zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_EQDC.h
/*
** ###################################################################
**     Processors:          MC56F80623VLC
**                          MC56F80626VLF
**                          MC56F80643VLC
**                          MC56F80646VLF
**                          MC56F80648VLH
**                          MC56F80723VLC
**                          MC56F80726VLF
**                          MC56F80733VFM
**                          MC56F80736VLF
**                          MC56F80738VLH
**                          MC56F80743VFM
**                          MC56F80743VLC
**                          MC56F80746MLF
**                          MC56F80746VLF
**                          MC56F80748MLH
**                          MC56F80748VLH
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for EQDC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2022-01-12)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_EQDC.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for EQDC
 *
 * CMSIS Peripheral Access Layer for EQDC
 */

#if !defined(PERI_EQDC_H_)
#define PERI_EQDC_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F80623VLC))
#include "MC56F80623_COMMON.h"
#elif (defined(CPU_MC56F80626VLF))
#include "MC56F80626_COMMON.h"
#elif (defined(CPU_MC56F80643VLC))
#include "MC56F80643_COMMON.h"
#elif (defined(CPU_MC56F80646VLF))
#include "MC56F80646_COMMON.h"
#elif (defined(CPU_MC56F80648VLH))
#include "MC56F80648_COMMON.h"
#elif (defined(CPU_MC56F80723VLC))
#include "MC56F80723_COMMON.h"
#elif (defined(CPU_MC56F80726VLF))
#include "MC56F80726_COMMON.h"
#elif (defined(CPU_MC56F80733VFM))
#include "MC56F80733_COMMON.h"
#elif (defined(CPU_MC56F80736VLF))
#include "MC56F80736_COMMON.h"
#elif (defined(CPU_MC56F80738VLH))
#include "MC56F80738_COMMON.h"
#elif (defined(CPU_MC56F80743VFM) || defined(CPU_MC56F80743VLC))
#include "MC56F80743_COMMON.h"
#elif (defined(CPU_MC56F80746MLF) || defined(CPU_MC56F80746VLF))
#include "MC56F80746_COMMON.h"
#elif (defined(CPU_MC56F80748MLH) || defined(CPU_MC56F80748VLH))
#include "MC56F80748_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- EQDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EQDC_Peripheral_Access_Layer EQDC Peripheral Access Layer
 * @{
 */

/** EQDC - Register Layout Typedef */
typedef struct {
  __IO uint16_t CTRL;                              /**< Control Register, offset: 0x0 */
  __IO uint16_t CTRL2;                             /**< Control 2 Register, offset: 0x1 */
  __IO uint16_t FILT;                              /**< Input Filter Register, offset: 0x2 */
  __I  uint16_t LASTEDGE;                          /**< Last Edge Time Register, offset: 0x3 */
  __I  uint16_t POSDPER;                           /**< Position Difference Period Counter Register, offset: 0x4 */
  __I  uint16_t POSDPERBFR;                        /**< Position Difference Period Buffer Register, offset: 0x5 */
  __IO uint16_t UPOS;                              /**< Upper Position Counter Register, offset: 0x6 */
  __IO uint16_t LPOS;                              /**< Lower Position Counter Register, offset: 0x7 */
  __IO uint16_t POSD;                              /**< Position Difference Counter Register, offset: 0x8 */
  __I  uint16_t POSDH;                             /**< Position Difference Hold Register, offset: 0x9 */
  __I  uint16_t UPOSH;                             /**< Upper Position Hold Register, offset: 0xA */
  __I  uint16_t LPOSH;                             /**< Lower Position Hold Register, offset: 0xB */
  __I  uint16_t LASTEDGEH;                         /**< Last Edge Time Hold Register, offset: 0xC */
  __I  uint16_t POSDPERH;                          /**< Position Difference Period Hold Register, offset: 0xD */
  __I  uint16_t REVH;                              /**< Revolution Hold Register, offset: 0xE */
  __IO uint16_t REV;                               /**< Revolution Counter Register, offset: 0xF */
  __IO uint16_t UINIT;                             /**< Upper Initialization Register, offset: 0x10 */
  __IO uint16_t LINIT;                             /**< Lower Initialization Register, offset: 0x11 */
  __IO uint16_t UMOD;                              /**< Upper Modulus Register, offset: 0x12 */
  __IO uint16_t LMOD;                              /**< Lower Modulus Register, offset: 0x13 */
  __IO uint16_t UCOMP0;                            /**< Upper Position Compare Register 0, offset: 0x14 */
  __IO uint16_t LCOMP0;                            /**< Lower Position Compare Register 0, offset: 0x15 */
  union {                                          /* offset: 0x16 */
    __O  uint16_t UCOMP1;                            /**< Upper Position Compare 1, offset: 0x16 */
    __I  uint16_t UPOSH1;                            /**< Upper Position Holder Register 1, offset: 0x16 */
  };
  union {                                          /* offset: 0x17 */
    __O  uint16_t LCOMP1;                            /**< Lower Position Compare 1, offset: 0x17 */
    __I  uint16_t LPOSH1;                            /**< Lower Position Holder Register 1, offset: 0x17 */
  };
  union {                                          /* offset: 0x18 */
    __O  uint16_t UCOMP2;                            /**< Upper Position Compare 2, offset: 0x18 */
    __I  uint16_t UPOSH2;                            /**< Upper Position Holder Register 3, offset: 0x18 */
  };
  union {                                          /* offset: 0x19 */
    __O  uint16_t LCOMP2;                            /**< Lower Position Compare 2, offset: 0x19 */
    __I  uint16_t LPOSH2;                            /**< Lower Position Holder Register 2, offset: 0x19 */
  };
  union {                                          /* offset: 0x1A */
    __O  uint16_t UCOMP3;                            /**< Upper Position Compare 3, offset: 0x1A */
    __I  uint16_t UPOSH3;                            /**< Upper Position Holder Register 3, offset: 0x1A */
  };
  union {                                          /* offset: 0x1B */
    __O  uint16_t LCOMP3;                            /**< Lower Position Compare 3, offset: 0x1B */
    __I  uint16_t LPOSH3;                            /**< Lower Position Holder Register 3, offset: 0x1B */
  };
  __IO uint16_t INTCTRL;                           /**< Interrupt Control Register, offset: 0x1C */
  __IO uint16_t WTR;                               /**< Watchdog Timeout Register, offset: 0x1D */
  __IO uint16_t IMR;                               /**< Input Monitor Register, offset: 0x1E */
  __IO uint16_t TST;                               /**< Test Register, offset: 0x1F */
} EQDC_Type;

/* ----------------------------------------------------------------------------
   -- EQDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EQDC_Register_Masks EQDC Register Masks
 * @{
 */

